"use client";
import { Fade } from "react-awesome-reveal";
const Page = () => {
  return (
    <div>
      <Fade direction="down">
        <h2 className="p-5 bg-white rounded-md shadow-md my-1">
          What Is a Full Stack Developer? <br />
          বর্তমান সময়ে ফুল স্ট্যাক হলো সবচেয়ে জনপ্রিয় ওয়েব ডেভেলপমেন্ট স্ট্যাক।
          একজন ফুল স্ট্যাক ডেভেলপারের প্রচুর দক্ষতা থাকে, তাই সফটওয়্যার
          কোম্পানিগুলোতে তাদের চাহিদা অনেক বেশি। <br /> ফুল স্ট্যাক ডেভেলপমেন্ট
          বলতে বোঝায় কোনো ওয়েব অ্যাপ বা ওয়েবসাইটের ফ্রন্ট এন্ড (ক্লায়েন্ট সাইড)
          এবং ব্যাক এন্ড (সার্ভার সাইড) নিয়ে কাজ করা। সহজ ভাষায় বললে, একটি
          ওয়েবসাইটের ফ্রন্ট এন্ড, ব্যাক এন্ড, ডাটাবেজ ম্যানেজমেন্ট, ডিবাগিং,
          সার্ভার সেটআপ, সিকিউরিটি সিস্টেম ইত্যাদি সবকিছু নিয়ে কাজ করা এবং তা
          মনিটর করাই হলো একজন ফুল স্ট্যাক ডেভেলপারের কাজ। এই ছাড়াও নেক্সট লেভেল
          ডেভেলপারের হতে হলে, হালকা পাতলা, DevOps জানতে হবে, docker,
          ডিপ্লয়মেন্টস চলে আসে এর মধ্যে। তাছাড়াও CI/CD ও লেগে যেতে পারে সো
          DevOps এর এই খুটি নাটি বিষয় গুলা একজন ডেভেলপার এর জানা উচিৎ।
        </h2>
      </Fade>
      <Fade direction="right">
        <h1 className="p-5 bg-white rounded-md shadow-md my-1">
          Why PostgreSQL is a Must-Learn Database in 2024? <br /> ডাটাবেজের
          বিশাল জগতে, SQL এবং NoSQL এই দুটি প্রধান শাখা হিসেবে বিবেচিত হয়।
          দুটিরই নিজস্ব সুবিধা এবং অসুবিধা রয়েছে, যা বিভিন্ন ধরনের
          অ্যাপ্লিকেশনে তাদের কে ব্যাবহার উপযোগী করে তোলে। যদিও NoSQL
          ডাটাবেসগুলি তাদের স্কেলাবিলিটি এবং ফ্লেক্সিবিলিটি এর জন্য সুপরিচিত,
          তবে SQL ডাটাবেজ, বিশেষ করে PostgreSQL এর নিজস্ব একগুচ্ছ সুবিধা রয়েছে
          যার কারনে ডেভেলপাররা অনেকেই এটি কে তাদের প্রথম পছন্দ হিসেবে রাখছেন।{" "}
          <br />
          কেন SQL, বিশেষ করে PostgreSQL, শিখতে হবে: <br />
          PostgreSQL হচ্ছে পুরদস্তুর ACID-compliant যার মানে হল যে ডাটা সর্বদা
          সঠিক এবং Consistent থাকবে এবং এটা সেইফ transactions ও নিশ্চিত করতে
          সহায়তা করে। MongoDB ও কিছু লিমিটেশন সহকারে ACID সাপোর্ট করে কিন্তু বড়
          কোন এপ্লিকেশনের ক্ষেত্রে সেইম লেভেল এর Robustness নাও পাওয়া যেতে পারে।
          যা ফাইন্যান্সিয়াল সিস্টেম যেমন ই-কমার্স প্ল্যাটফর্ম এবং অন্যান্য
          ক্রিটিক্যাল অ্যাপ্লিকেশনের জন্য অত্যন্ত গুরুত্বপূর্ণ।
        </h1>
      </Fade>
      <Fade direction="up">
        <h2 className="p-5  bg-white rounded-md shadow-md my-1">
          ১০০% জব রেডি কোর্স সমাচার <br />
          বর্তমান সময়ে জব মার্কেটে পরিবর্তনটা যে কতটা দ্রুত ঘটে চলেছে, তা আমরা
          সবাই অনুভব করছি। অনেক কোর্স প্রোভাইডাররা &apos;জব রেডি&apos; টার্মটা
          ব্যবহার করে অনেক বড়ো বড়ো প্রতিশ্রুতি দেয়, কিন্তু বাস্তবে কতটা
          প্রস্তুতি নিশ্চিত করা হচ্ছে, তা ভাবনার বিষয়। শুধু কোর্স করে জব পাওয়া
          যাবে, এই ধরনের প্রতিশ্রুতি দেওয়ার আগে, ইন্টারভিউ প্রিপারেশন, সফট
          স্কিল ডেভেলপমেন্ট, এবং রিয়েল-ওয়ার্ল্ড প্রবলেম সলভিং স্কিলের উপরে আরও
          বেশি জোর দেওয়া উচিত। এছাড়াও, জব ল্যান্ডিং এর পরে স্টেবিলিটি নিয়ে যে
          উদ্বেগ আপনি উল্লেখ করেছেন, সেটা অনেক বাস্তবসম্মত। অনেক জায়গায় দেখা
          যায়, ইন্টার্নশিপের পরে ফুল-টাইম অফার না আসা বা ছাঁটাই হওয়ার কারণে
          মানুষ মানসিক চাপে পড়ে। আমার মতে, এই ধরনের পরিস্থিতির জন্যও কোর্স
          প্রোভাইডারদের কিছু পরিকল্পনা থাকা উচিত। একটি জিনিস আরও বলা দরকার, যারা
          জব রেডি হওয়ার পথে আছেন, তাদের জন্য শুধু টেকনিক্যাল জ্ঞান নয়, বরং
          পুরো ইন্ডাস্ট্রির রিকোয়ারমেন্ট এবং রিক্রুটমেন্ট প্রোসেস নিয়ে ধারণা
          দেওয়াটা খুবই গুরুত্বপূর্ণ। আশা করছি ভবিষ্যতে আরও উন্নত এবং ফোকাসড
          সমাধান আমরা দেখতে পাব।
        </h2>
      </Fade>
    </div>
  );
};

export default Page;
