"use client";
import { Fade } from "react-awesome-reveal";
const Page = () => {
  return (
    <div>
      <Fade direction="down">
        <h2 className="p-5 bg-white rounded-md shadow-md my-1">
          What Is a Full Stack Developer? <br />
          বর্তমান সময়ে ফুল স্ট্যাক হলো সবচেয়ে জনপ্রিয় ওয়েব ডেভেলপমেন্ট স্ট্যাক।
          একজন ফুল স্ট্যাক ডেভেলপারের প্রচুর দক্ষতা থাকে, তাই সফটওয়্যার
          কোম্পানিগুলোতে তাদের চাহিদা অনেক বেশি। <br /> ফুল স্ট্যাক ডেভেলপমেন্ট
          বলতে বোঝায় কোনো ওয়েব অ্যাপ বা ওয়েবসাইটের ফ্রন্ট এন্ড (ক্লায়েন্ট সাইড)
          এবং ব্যাক এন্ড (সার্ভার সাইড) নিয়ে কাজ করা। সহজ ভাষায় বললে, একটি
          ওয়েবসাইটের ফ্রন্ট এন্ড, ব্যাক এন্ড, ডাটাবেজ ম্যানেজমেন্ট, ডিবাগিং,
          সার্ভার সেটআপ, সিকিউরিটি সিস্টেম ইত্যাদি সবকিছু নিয়ে কাজ করা এবং তা
          মনিটর করাই হলো একজন ফুল স্ট্যাক ডেভেলপারের কাজ। এই ছাড়াও নেক্সট লেভেল
          ডেভেলপারের হতে হলে, হালকা পাতলা, DevOps জানতে হবে, docker,
          ডিপ্লয়মেন্টস চলে আসে এর মধ্যে। তাছাড়াও CI/CD ও লেগে যেতে পারে সো
          DevOps এর এই খুটি নাটি বিষয় গুলা একজন ডেভেলপার এর জানা উচিৎ।
        </h2>
      </Fade>
      <Fade direction="right">
        <h1 className="p-5 bg-white rounded-md shadow-md my-1">
          Why PostgreSQL is a Must-Learn Database in 2024? <br /> ডাটাবেজের
          বিশাল জগতে, SQL এবং NoSQL এই দুটি প্রধান শাখা হিসেবে বিবেচিত হয়।
          দুটিরই নিজস্ব সুবিধা এবং অসুবিধা রয়েছে, যা বিভিন্ন ধরনের
          অ্যাপ্লিকেশনে তাদের কে ব্যাবহার উপযোগী করে তোলে। যদিও NoSQL
          ডাটাবেসগুলি তাদের স্কেলাবিলিটি এবং ফ্লেক্সিবিলিটি এর জন্য সুপরিচিত,
          তবে SQL ডাটাবেজ, বিশেষ করে PostgreSQL এর নিজস্ব একগুচ্ছ সুবিধা রয়েছে
          যার কারনে ডেভেলপাররা অনেকেই এটি কে তাদের প্রথম পছন্দ হিসেবে রাখছেন।{" "}
          <br />
          কেন SQL, বিশেষ করে PostgreSQL, শিখতে হবে: <br />
          PostgreSQL হচ্ছে পুরদস্তুর ACID-compliant যার মানে হল যে ডাটা সর্বদা
          সঠিক এবং Consistent থাকবে এবং এটা সেইফ transactions ও নিশ্চিত করতে
          সহায়তা করে। MongoDB ও কিছু লিমিটেশন সহকারে ACID সাপোর্ট করে কিন্তু বড়
          কোন এপ্লিকেশনের ক্ষেত্রে সেইম লেভেল এর Robustness নাও পাওয়া যেতে পারে।
          যা ফাইন্যান্সিয়াল সিস্টেম যেমন ই-কমার্স প্ল্যাটফর্ম এবং অন্যান্য
          ক্রিটিক্যাল অ্যাপ্লিকেশনের জন্য অত্যন্ত গুরুত্বপূর্ণ।
        </h1>
      </Fade>
      <Fade direction="down">
        <h2 className="p-5  bg-white rounded-md shadow-md my-1">
          AWS বা Docker নিয়ে বাংলা আর্টিকেল <br />
          Amazon Web Services (AWS) হলো একটি ক্লাউড কম্পিউটিং প্ল্যাটফর্ম যা বিভিন্ন ধরনের ক্লাউড-ভিত্তিক সেবা প্রদান করে। AWS বর্তমানে বিশ্বের অন্যতম জনপ্রিয় ক্লাউড সেবা প্রদানকারী। এটি ডেভেলপার এবং ব্যবসার জন্য অনেক সুবিধা এনে দিয়েছে।
          <br />
          Docker হলো একটি ওপেন-সোর্স প্ল্যাটফর্ম যা অ্যাপ্লিকেশন এবং তার নির্ভরশীলতাগুলোকে একত্রিত করে একটি কন্টেইনারে প্যাকেজ করে। এটি মূলত ডেভেলপারদের অ্যাপ্লিকেশন তৈরি, শেয়ার, এবং রান করার প্রক্রিয়া সহজ করে তোলে।
          <br />
          AWS এবং Docker একত্রে ব্যবহারের সুবিধা <br />
          AWS-এ Docker ব্যবহার করে আপনি সহজেই কন্টেইনারাইজড অ্যাপ্লিকেশন ডেপ্লয় করতে পারেন। AWS Elastic Kubernetes Service (EKS) এবং AWS Elastic Container Service (ECS) Docker কন্টেইনার ম্যানেজমেন্টকে আরও সহজ করে তোলে।
        </h2>
      </Fade>
    </div>
  );
};

export default Page;
